[
  {
    "id": 1,
    "title": "Financial Education",
    "date": "4th of December",
    "location": "OA5 - CFDP",
    "trainer": "Olimpia Pop",
    "image": "images/trainings/finance.webp",
    "description": "Managing your finances effectively is a critical step toward achieving stability and reaching your long-term goals. In this training, Olimpia Pop will guide you through the essentials of personal finance, equipping you with practical tools to take control of your money. You'll learn how to create a realistic budget, manage your expenses wisely, and establish smart saving habits. Olimpia will also discuss strategies for setting financial goals, avoiding common financial pitfalls, and building a secure foundation for the future. This interactive session is designed to give you the knowledge and confidence to make informed financial decisions, whether you're managing your first paycheck or planning for bigger milestones. Take part and start your journey toward financial independence!"
  },
  {
    "id": 2,
    "title": "Work-Life Balance",
    "date": "25 & 28 November",
    "location": "The ground floor of the BT building (street George Barițiu nr. 4-8)",
    "trainer": "Denisa Nita",
    "image": "images/trainings/worklife.webp",
    "description": "Balancing personal well-being with professional aspirations is essential for success and fulfillment. In this training, Denisa Nita, an experienced psychologist, will guide you through strategies to create a healthier work-life balance and navigate common challenges. You'll learn practical tools to manage your priorities, reduce stress, and improve productivity. Denisa will also explore the impostor syndrome—an experience many students face when transitioning into the workforce—and share effective ways to overcome self-doubt and build confidence. This interactive session is designed to equip you with the skills and mindset needed to balance your career and personal life, ensuring long-term well-being and success. Join us and take the first step toward a more balanced and fulfilling life!"
  },
  {
    "id": 3,
    "title": "How to Interview",
    "date": "November 21st, 20:00",
    "location": "OA5 - CFDP",
    "trainer": "Cristina Gogozan",
    "image": "images/trainings/interview.webp",
    "description": "A successful job interview can make all the difference when it comes to securing your ideal position. In this workshop, Cristina Gogozan will help you master the art of the job interview. You'll learn how to effectively prepare for interviews, including researching the company, anticipating common questions, and developing thoughtful responses. Cristina will also share strategies for building rapport with interviewers, communicating your strengths confidently, and handling tricky or unexpected questions. This interactive session will give you the practical skills and confidence needed to make a positive impression and stand out in any interview setting."
  },
  {
    "id": 4,
    "title": "How to Start a Startup",
    "date": "November 7th, 18:00",
    "location": "OA5 - CFDP",
    "trainer": "Georgina Lupu (Gina)",
    "image": "images/trainings/startup.webp",
    "description": "Starting your own business can be both exciting and daunting. This workshop, led by Georgina Lupu, will take you through the fundamentals of launching a startup. You'll learn about identifying viable business ideas, developing a business plan, securing funding, and the key challenges faced by new entrepreneurs. Whether you're already working on a startup or just exploring the idea of entrepreneurship, this session will provide you with the tools and mindset needed to succeed."
  },
  {
    "id": 5,
    "title": "How to CV",
    "date": "October 30th, 18:00",
    "location": "A3 - CFDP",
    "trainer": "Mariana Irimia",
    "image": "images/trainings/cv.webp",
    "description": "A well-crafted CV is often your first point of contact with potential employers, making it a crucial part of your job application process. In this workshop, led by Mariana Irimia, you'll learn how to structure and present your CV to highlight your most important skills and experiences. The session will cover common mistakes to avoid, tips for tailoring your CV to different industries, and how to stand out in a competitive job market. Mariana's expertise will help ensure that your CV leaves a strong impression and effectively communicates your qualifications to employers."
  }
]
